CPS-Projet/tests/html/tMoteurJeu.html
<?xml version="1.0" encoding="utf-8"?>

<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"

               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml"

lang="en" xml:lang="en">

<head>

<title>tMoteurJeu</title>

<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>

<meta name="generator" content="Org-mode"/>

<meta name="generated" content="2014-04-18 12:57:47 CEST"/>



<meta name="description" content=""/>

<meta name="keywords" content=""/>



</head>

<body>

<div id="content">



<h1 class="title">tMoteurJeu</h1>





<div id="table-of-contents">

<h2>Table of Contents</h2>

<div id="text-table-of-contents">

<ul>

<li><a href="#sec-1">1 Test MoteurJeu </a>

<ul>

<li><a href="#sec-1.1">1.1 Cas de test 1.1 : MoteurJeu::testInit </a>

<ul>

<li><a href="#sec-1.1.1">1.1.1 Condition initiale : ∅ </a></li>

<li><a href="#sec-1.1.2">1.1.2 Operation : L0 =(def) init(20, 4, 10, 100) </a></li>

<li><a href="#sec-1.1.3">1.1.3 Oracle : </a></li>

</ul>

</li>

<li><a href="#sec-1.2">1.2 Cas de test 1.2 : MoteurJeu::testInitFail1 </a>

<ul>

<li><a href="#sec-1.2.1">1.2.1 Condition initiale : ∅ </a></li>

<li><a href="#sec-1.2.2">1.2.2 Operation : L0 =(def) init(-20, 4, 10, 100) </a></li>

<li><a href="#sec-1.2.3">1.2.3 Oracle : </a></li>

</ul>

</li>

<li><a href="#sec-1.3">1.3 Cas de test 1.3 : MoteurJeu::testInitFail2 </a>

<ul>

<li><a href="#sec-1.3.1">1.3.1 Condition initiale : ∅ </a></li>

<li><a href="#sec-1.3.2">1.3.2 Operation : L0 =(def) init(20, -4, 10, 100) </a></li>

<li><a href="#sec-1.3.3">1.3.3 Oracle : </a></li>

</ul>

</li>

<li><a href="#sec-1.4">1.4 Cas de test 1.4 : MoteurJeu::testInitFail3 </a>

<ul>

<li><a href="#sec-1.4.1">1.4.1 Condition initiale : ∅ </a></li>

<li><a href="#sec-1.4.2">1.4.2 Operation : L0 =(def) init(20, 4, -10, 100) </a></li>

<li><a href="#sec-1.4.3">1.4.3 Oracle : </a></li>

</ul>

</li>

<li><a href="#sec-1.5">1.5 Cas de test 1.5 : MoteurJeu::testInitFail4 </a>

<ul>

<li><a href="#sec-1.5.1">1.5.1 Condition initiale : ∅ </a></li>

<li><a href="#sec-1.5.2">1.5.2 Operation : L0 =(def) init(20, 4, 10, 0) </a></li>

<li><a href="#sec-1.5.3">1.5.3 Oracle : </a></li>

</ul>

</li>

<li><a href="#sec-1.6">1.6 Cas de test 2.1 : MoteurJeu::pasJeu1 </a>

<ul>

<li><a href="#sec-1.6.1">1.6.1 Condition initiale : L =(def) init(20, 4, 10, 0) </a></li>

<li><a href="#sec-1.6.2">1.6.2 Operation : L0 =(def) pasJeu(cmdA, cmdR) </a></li>

<li><a href="#sec-1.6.3">1.6.3 Oracle : </a></li>

</ul>

</li>

<li><a href="#sec-1.7">1.7 Cas de test 2.2 : MoteurJeu::pasJeu2 </a>

<ul>

<li><a href="#sec-1.7.1">1.7.1 Condition initiale : L =(def) init(20, 4, 10, 0) </a></li>

<li><a href="#sec-1.7.2">1.7.2 Operation : L0 =(def) pasJeu("Alex", cmd) </a></li>

<li><a href="#sec-1.7.3">1.7.3 Oracle : </a></li>

</ul>

</li>

<li><a href="#sec-1.8">1.8 Cas de test 2.3 : MoteurJeu::pasJeu3 </a>

<ul>

<li><a href="#sec-1.8.1">1.8.1 Condition initiale : L =(def) init(20, 4, 10, 0) </a></li>

<li><a href="#sec-1.8.2">1.8.2 Operation : L0 =(def) pasJeu("Ryan", cmd) </a></li>

<li><a href="#sec-1.8.3">1.8.3 Oracle : </a></li>

</ul>

</li>

<li><a href="#sec-1.9">1.9 Cas de test 2.4 : MoteurJeu::pasJeu4 </a>

<ul>

<li><a href="#sec-1.9.1">1.9.1 Condition initiale : L =(def) init(20, 4, 10, 0) </a></li>

<li><a href="#sec-1.9.2">1.9.2 Operation : L0 =(def) pasJeu("autre", cmd) </a></li>

<li><a href="#sec-1.9.3">1.9.3 Oracle : </a></li>

</ul>

</li>

</ul>

</li>

</ul>

</div>

</div>



<div id="outline-container-1" class="outline-2">

<h2 id="sec-1"><span class="section-number-2">1</span> Test MoteurJeu </h2>

<div class="outline-text-2" id="text-1">







</div>



<div id="outline-container-1.1" class="outline-3">

<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Cas de test 1.1 : MoteurJeu::testInit </h3>

<div class="outline-text-3" id="text-1.1">





</div>



<div id="outline-container-1.1.1" class="outline-4">

<h4 id="sec-1.1.1"><span class="section-number-4">1.1.1</span> Condition initiale : ∅ </h4>

<div class="outline-text-4" id="text-1.1.1">



</div>



</div>



<div id="outline-container-1.1.2" class="outline-4">

<h4 id="sec-1.1.2"><span class="section-number-4">1.1.2</span> Operation : L0 =(def) init(20, 4, 10, 100) </h4>

<div class="outline-text-4" id="text-1.1.2">



</div>



</div>



<div id="outline-container-1.1.3" class="outline-4">

<h4 id="sec-1.1.3"><span class="section-number-4">1.1.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.1.3">



<ul>

<li id="sec-1.1.3.1">estFini(L0) = false <br/>

</li>

<li id="sec-1.1.3.2">maxPasJeu(L0) = 100 <br/>

</li>

<li id="sec-1.1.3.3">pasJeuCourant(L0) = 0 <br/>



</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.2" class="outline-3">

<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Cas de test 1.2 : MoteurJeu::testInitFail1 </h3>

<div class="outline-text-3" id="text-1.2">





</div>



<div id="outline-container-1.2.1" class="outline-4">

<h4 id="sec-1.2.1"><span class="section-number-4">1.2.1</span> Condition initiale : ∅ </h4>

<div class="outline-text-4" id="text-1.2.1">



</div>



</div>



<div id="outline-container-1.2.2" class="outline-4">

<h4 id="sec-1.2.2"><span class="section-number-4">1.2.2</span> Operation : L0 =(def) init(-20, 4, 10, 100) </h4>

<div class="outline-text-4" id="text-1.2.2">



</div>



</div>



<div id="outline-container-1.2.3" class="outline-4">

<h4 id="sec-1.2.3"><span class="section-number-4">1.2.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.2.3">



<ul>

<li id="sec-1.2.3.1">-20 &gt; 0 <br/>

</li>

<li id="sec-1.2.3.2">#exception levee <br/>



</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.3" class="outline-3">

<h3 id="sec-1.3"><span class="section-number-3">1.3</span> Cas de test 1.3 : MoteurJeu::testInitFail2 </h3>

<div class="outline-text-3" id="text-1.3">





</div>



<div id="outline-container-1.3.1" class="outline-4">

<h4 id="sec-1.3.1"><span class="section-number-4">1.3.1</span> Condition initiale : ∅ </h4>

<div class="outline-text-4" id="text-1.3.1">



</div>



</div>



<div id="outline-container-1.3.2" class="outline-4">

<h4 id="sec-1.3.2"><span class="section-number-4">1.3.2</span> Operation : L0 =(def) init(20, -4, 10, 100) </h4>

<div class="outline-text-4" id="text-1.3.2">



</div>



</div>



<div id="outline-container-1.3.3" class="outline-4">

<h4 id="sec-1.3.3"><span class="section-number-4">1.3.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.3.3">



<ul>

<li id="sec-1.3.3.1">-4 &gt; 0 <br/>

</li>

<li id="sec-1.3.3.2">#exception levee <br/>



</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.4" class="outline-3">

<h3 id="sec-1.4"><span class="section-number-3">1.4</span> Cas de test 1.4 : MoteurJeu::testInitFail3 </h3>

<div class="outline-text-3" id="text-1.4">





</div>



<div id="outline-container-1.4.1" class="outline-4">

<h4 id="sec-1.4.1"><span class="section-number-4">1.4.1</span> Condition initiale : ∅ </h4>

<div class="outline-text-4" id="text-1.4.1">



</div>



</div>



<div id="outline-container-1.4.2" class="outline-4">

<h4 id="sec-1.4.2"><span class="section-number-4">1.4.2</span> Operation : L0 =(def) init(20, 4, -10, 100) </h4>

<div class="outline-text-4" id="text-1.4.2">



</div>



</div>



<div id="outline-container-1.4.3" class="outline-4">

<h4 id="sec-1.4.3"><span class="section-number-4">1.4.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.4.3">



<ul>

<li id="sec-1.4.3.1">-10 &gt; 0 <br/>

</li>

<li id="sec-1.4.3.2">#exception levee <br/>



</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.5" class="outline-3">

<h3 id="sec-1.5"><span class="section-number-3">1.5</span> Cas de test 1.5 : MoteurJeu::testInitFail4 </h3>

<div class="outline-text-3" id="text-1.5">





</div>



<div id="outline-container-1.5.1" class="outline-4">

<h4 id="sec-1.5.1"><span class="section-number-4">1.5.1</span> Condition initiale : ∅ </h4>

<div class="outline-text-4" id="text-1.5.1">



</div>



</div>



<div id="outline-container-1.5.2" class="outline-4">

<h4 id="sec-1.5.2"><span class="section-number-4">1.5.2</span> Operation : L0 =(def) init(20, 4, 10, 0) </h4>

<div class="outline-text-4" id="text-1.5.2">



</div>



</div>



<div id="outline-container-1.5.3" class="outline-4">

<h4 id="sec-1.5.3"><span class="section-number-4">1.5.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.5.3">



<ul>

<li id="sec-1.5.3.1">0 &gt; 0 <br/>

</li>

<li id="sec-1.5.3.2">#exception levee <br/>













</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.6" class="outline-3">

<h3 id="sec-1.6"><span class="section-number-3">1.6</span> Cas de test 2.1 : MoteurJeu::pasJeu1 </h3>

<div class="outline-text-3" id="text-1.6">





</div>



<div id="outline-container-1.6.1" class="outline-4">

<h4 id="sec-1.6.1"><span class="section-number-4">1.6.1</span> Condition initiale : L =(def) init(20, 4, 10, 0) </h4>

<div class="outline-text-4" id="text-1.6.1">



</div>



</div>



<div id="outline-container-1.6.2" class="outline-4">

<h4 id="sec-1.6.2"><span class="section-number-4">1.6.2</span> Operation : L0 =(def) pasJeu(cmdA, cmdR) </h4>

<div class="outline-text-4" id="text-1.6.2">



</div>



</div>



<div id="outline-container-1.6.3" class="outline-4">

<h4 id="sec-1.6.3"><span class="section-number-4">1.6.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.6.3">



<ul>

<li id="sec-1.6.3.1">pasJeuCourant(L0) = pasJeuCourant(L) + 1 <br/>



</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.7" class="outline-3">

<h3 id="sec-1.7"><span class="section-number-3">1.7</span> Cas de test 2.2 : MoteurJeu::pasJeu2 </h3>

<div class="outline-text-3" id="text-1.7">





</div>



<div id="outline-container-1.7.1" class="outline-4">

<h4 id="sec-1.7.1"><span class="section-number-4">1.7.1</span> Condition initiale : L =(def) init(20, 4, 10, 0) </h4>

<div class="outline-text-4" id="text-1.7.1">



</div>



</div>



<div id="outline-container-1.7.2" class="outline-4">

<h4 id="sec-1.7.2"><span class="section-number-4">1.7.2</span> Operation : L0 =(def) pasJeu("Alex", cmd) </h4>

<div class="outline-text-4" id="text-1.7.2">



</div>



</div>



<div id="outline-container-1.7.3" class="outline-4">

<h4 id="sec-1.7.3"><span class="section-number-4">1.7.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.7.3">



<ul>

<li id="sec-1.7.3.1">pasJeuCourant(L0) = pasJeuCourant(L) + 1 <br/>



</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.8" class="outline-3">

<h3 id="sec-1.8"><span class="section-number-3">1.8</span> Cas de test 2.3 : MoteurJeu::pasJeu3 </h3>

<div class="outline-text-3" id="text-1.8">





</div>



<div id="outline-container-1.8.1" class="outline-4">

<h4 id="sec-1.8.1"><span class="section-number-4">1.8.1</span> Condition initiale : L =(def) init(20, 4, 10, 0) </h4>

<div class="outline-text-4" id="text-1.8.1">



</div>



</div>



<div id="outline-container-1.8.2" class="outline-4">

<h4 id="sec-1.8.2"><span class="section-number-4">1.8.2</span> Operation : L0 =(def) pasJeu("Ryan", cmd) </h4>

<div class="outline-text-4" id="text-1.8.2">



</div>



</div>



<div id="outline-container-1.8.3" class="outline-4">

<h4 id="sec-1.8.3"><span class="section-number-4">1.8.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.8.3">



<ul>

<li id="sec-1.8.3.1">pasJeuCourant(L0) = pasJeuCourant(L) + 1 <br/>



</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.9" class="outline-3">

<h3 id="sec-1.9"><span class="section-number-3">1.9</span> Cas de test 2.4 : MoteurJeu::pasJeu4 </h3>

<div class="outline-text-3" id="text-1.9">





</div>



<div id="outline-container-1.9.1" class="outline-4">

<h4 id="sec-1.9.1"><span class="section-number-4">1.9.1</span> Condition initiale : L =(def) init(20, 4, 10, 0) </h4>

<div class="outline-text-4" id="text-1.9.1">



</div>



</div>



<div id="outline-container-1.9.2" class="outline-4">

<h4 id="sec-1.9.2"><span class="section-number-4">1.9.2</span> Operation : L0 =(def) pasJeu("autre", cmd) </h4>

<div class="outline-text-4" id="text-1.9.2">



</div>



</div>



<div id="outline-container-1.9.3" class="outline-4">

<h4 id="sec-1.9.3"><span class="section-number-4">1.9.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.9.3">



<ul>

<li id="sec-1.9.3.1"><span class="todo TODO"> TODO</span> signe different autre != Ryan ∨ Alex <br/>

</li>

<li id="sec-1.9.3.2">#exception levee <br/>









</li>

</ul>

</div>

</div>

</div>

</div>

<div id="postamble">

<p class="author"> Authors: Kevin Coquart, Quentin Bunel



</p>

<p class="date"> Date: 2014-04-18 12:57:47 CEST</p>

<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>

</div>

</div>

</body>

</html>

