CPS-Projet/tests/tex/tMoteurJeu.tex
% Created 2014-04-18 ven. 12:57
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{amssymb}
\usepackage{hyperref}


\title{TMoteurJeu}
\author{Kevin Coquart, Quentin Bunel}
\date{18 avril 2014}

\begin{document}

\maketitle

\setcounter{tocdepth}{3}
\tableofcontents
\vspace*{1cm}
\section{Test MoteurJeu}
\label{sec-1}


\subsection{Cas de test 1.1 : MoteurJeu::testInit}
\label{sec-1.1}

\subsubsection{Condition initiale : $\varnothing$}
\label{sec-1.1.1}

\subsubsection{Operation : L0 =(def) init(20, 4, 10, 100)}
\label{sec-1.1.2}

\subsubsection{Oracle :}
\label{sec-1.1.3}

\begin{itemize}

\item estFini(L0) = false\\
\label{sec-1.1.3.1}


\item maxPasJeu(L0) = 100\\
\label{sec-1.1.3.2}


\item pasJeuCourant(L0) = 0\\
\label{sec-1.1.3.3}


\end{itemize} % ends low level
\subsection{Cas de test 1.2 : MoteurJeu::testInitFail1}
\label{sec-1.2}

\subsubsection{Condition initiale : $\varnothing$}
\label{sec-1.2.1}

\subsubsection{Operation : L0 =(def) init(-20, 4, 10, 100)}
\label{sec-1.2.2}

\subsubsection{Oracle :}
\label{sec-1.2.3}

\begin{itemize}

\item -20 > 0\\
\label{sec-1.2.3.1}


\item \#exception levee\\
\label{sec-1.2.3.2}


\end{itemize} % ends low level
\subsection{Cas de test 1.3 : MoteurJeu::testInitFail2}
\label{sec-1.3}

\subsubsection{Condition initiale : $\varnothing$}
\label{sec-1.3.1}

\subsubsection{Operation : L0 =(def) init(20, -4, 10, 100)}
\label{sec-1.3.2}

\subsubsection{Oracle :}
\label{sec-1.3.3}

\begin{itemize}

\item -4 > 0\\
\label{sec-1.3.3.1}


\item \#exception levee\\
\label{sec-1.3.3.2}


\end{itemize} % ends low level
\subsection{Cas de test 1.4 : MoteurJeu::testInitFail3}
\label{sec-1.4}

\subsubsection{Condition initiale : $\varnothing$}
\label{sec-1.4.1}

\subsubsection{Operation : L0 =(def) init(20, 4, -10, 100)}
\label{sec-1.4.2}

\subsubsection{Oracle :}
\label{sec-1.4.3}

\begin{itemize}

\item -10 > 0\\
\label{sec-1.4.3.1}


\item \#exception levee\\
\label{sec-1.4.3.2}


\end{itemize} % ends low level
\subsection{Cas de test 1.5 : MoteurJeu::testInitFail4}
\label{sec-1.5}

\subsubsection{Condition initiale : $\varnothing$}
\label{sec-1.5.1}

\subsubsection{Operation : L0 =(def) init(20, 4, 10, 0)}
\label{sec-1.5.2}

\subsubsection{Oracle :}
\label{sec-1.5.3}

\begin{itemize}

\item 0 > 0\\
\label{sec-1.5.3.1}


\item \#exception levee\\
\label{sec-1.5.3.2}







\end{itemize} % ends low level
\subsection{Cas de test 2.1 : MoteurJeu::pasJeu1}
\label{sec-1.6}

\subsubsection{Condition initiale : L =(def) init(20, 4, 10, 0)}
\label{sec-1.6.1}

\subsubsection{Operation : L0 =(def) pasJeu(cmdA, cmdR)}
\label{sec-1.6.2}

\subsubsection{Oracle :}
\label{sec-1.6.3}

\begin{itemize}

\item pasJeuCourant(L0) = pasJeuCourant(L) + 1\\
\label{sec-1.6.3.1}


\end{itemize} % ends low level
\subsection{Cas de test 2.2 : MoteurJeu::pasJeu2}
\label{sec-1.7}

\subsubsection{Condition initiale : L =(def) init(20, 4, 10, 0)}
\label{sec-1.7.1}

\subsubsection{Operation : L0 =(def) pasJeu("Alex", cmd)}
\label{sec-1.7.2}

\subsubsection{Oracle :}
\label{sec-1.7.3}

\begin{itemize}

\item pasJeuCourant(L0) = pasJeuCourant(L) + 1\\
\label{sec-1.7.3.1}


\end{itemize} % ends low level
\subsection{Cas de test 2.3 : MoteurJeu::pasJeu3}
\label{sec-1.8}

\subsubsection{Condition initiale : L =(def) init(20, 4, 10, 0)}
\label{sec-1.8.1}

\subsubsection{Operation : L0 =(def) pasJeu("Ryan", cmd)}
\label{sec-1.8.2}

\subsubsection{Oracle :}
\label{sec-1.8.3}

\begin{itemize}

\item pasJeuCourant(L0) = pasJeuCourant(L) + 1\\
\label{sec-1.8.3.1}


\end{itemize} % ends low level
\subsection{Cas de test 2.4 : MoteurJeu::pasJeu4}
\label{sec-1.9}

\subsubsection{Condition initiale : L =(def) init(20, 4, 10, 0)}
\label{sec-1.9.1}

\subsubsection{Operation : L0 =(def) pasJeu("autre", cmd)}
\label{sec-1.9.2}

\subsubsection{Oracle :}
\label{sec-1.9.3}

\begin{itemize}

\item \textbf{TODO} signe different autre != Ryan $\vee$ Alex\\
\label{sec-1.9.3.1}


\item \#exception levee\\
\label{sec-1.9.3.2}





\end{itemize} % ends low level

\end{document}
